Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
          }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getConfiguration"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getConfiguration-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getConfiguration"
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the beacon configuration."
      + filename                       = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
      + function_name                  = "sbeacon-backend-getConfiguration"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getConfiguration.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getConfiguration",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          + "timestamp" = "1769764058517167000"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getDatasets"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getDatasets"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getDatasets-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getDatasets"
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getDatasets-1"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getDatasets"
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getDatasets-2"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getDatasets"
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getDatasets-3"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getDatasets"
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getDatasets-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getDatasets"
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the datasets."
      + filename                       = "builds/e07d951d661b60e158870dc03784c11675431fea90809ca3a34a70333df8e5a8.zip"
      + function_name                  = "sbeacon-backend-getDatasets"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e07d951d661b60e158870dc03784c11675431fea90809ca3a34a70333df8e5a8.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e07d951d661b60e158870dc03784c11675431fea90809ca3a34a70333df8e5a8.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/e07d951d661b60e158870dc03784c11675431fea90809ca3a34a70333df8e5a8.zip"
          + "timestamp" = "1769764059026702800"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getEntryTypes"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getEntryTypes"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getEntryTypes-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getEntryTypes"
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the beacon map."
      + filename                       = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
      + function_name                  = "sbeacon-backend-getEntryTypes"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getEntryTypes.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getEntryTypes",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          + "timestamp" = "1769764057996453000"
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getFilteringTerms"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getFilteringTerms"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getFilteringTerms-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getFilteringTerms"
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_iam_role_policy.additional_jsons[1] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getFilteringTerms-1"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getFilteringTerms"
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getFilteringTerms-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getFilteringTerms"
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the beacon map."
      + filename                       = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
      + function_name                  = "sbeacon-backend-getFilteringTerms"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getFilteringTerms",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          + "timestamp" = "1769764058533616000"
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getGenomicVariants"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getGenomicVariants"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getGenomicVariants-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getGenomicVariants"
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getGenomicVariants-1"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getGenomicVariants"
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getGenomicVariants-2"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getGenomicVariants"
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getGenomicVariants-3"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getGenomicVariants"
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getGenomicVariants-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getGenomicVariants"
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the variants."
      + filename                       = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
      + function_name                  = "sbeacon-backend-getGenomicVariants"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getGenomicVariants",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          + "timestamp" = "1769764057928967000"
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getIndividuals"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getIndividuals"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getIndividuals-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getIndividuals"
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getIndividuals-1"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getIndividuals"
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getIndividuals-2"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getIndividuals"
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getIndividuals-3"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getIndividuals"
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getIndividuals-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getIndividuals"
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the individuals."
      + filename                       = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
      + function_name                  = "sbeacon-backend-getIndividuals"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getIndividuals.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getIndividuals",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          + "timestamp" = "1769764057957706000"
        }
    }

  # module.sbeacon.module.lambda-getInfo.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getInfo"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getInfo"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getInfo.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getInfo-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getInfo"
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Returns basic information about the beacon and the datasets."
      + filename                       = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
      + function_name                  = "sbeacon-backend-getInfo"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getInfo.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getInfo",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          + "timestamp" = "1769764059260386000"
        }
    }

  # module.sbeacon.module.lambda-getMap.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getMap"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-getMap"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-getMap.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-getMap-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-getMap"
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Get the beacon map."
      + filename                       = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
      + function_name                  = "sbeacon-backend-getMap"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-getMap.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getMap",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          + "timestamp" = "1769764059064807800"
        }
    }

  # module.sbeacon.module.lambda-getProjects.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-getProjects"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.